cfd_bfs_2d/bfs_2d_fine/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    inlet
    {
        type            patch;
        nFaces          260;
        startFace       655948;
    }
    outlet
    {
        type            patch;
        nFaces          452;
        startFace       656208;
    }
    lowerWallStartup
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          8;
        startFace       656660;
    }
    upperWallStartup
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          8;
        startFace       656668;
    }
    upperWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          872;
        startFace       656676;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1064;
        startFace       657548;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          328640;
        startFace       658612;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          328640;
        startFace       987252;
    }
)

// ************************************************************************* //
